import React from "react";

const Skill = () => {
  return (
    <section id="skill">
      <div className="skill__inner">
        <h2 className="skill__title">Challenge <em>나의 도전</em></h2>
        <div className="skill__desc">
          <div>
            <span>1.</span>
            <h3>UI/UX 개발자</h3>
            <p>
              웹 퍼블리셔이자 프론트엔드 개발자로서 HTML, CSS, JavaScript를 활용해 다양한 웹사이트의 레이아웃과 기능을 구현해왔습니다.
              특히 사용자와 상호작용하는 인터랙티브적인 요소(애니메이션, 스크롤 이벤트, 다양한 이펙트, 모달(팝업창), 드롭다운 기능 등)를 구현하며
              사용자 경험을 한층 더 향상시키는 것을 목표로 해왔습니다.
              단순히 사이트 구현에 그치지 않고, 사용자 중심의 최적화된 웹 환경을 만드는 데 집중하며
              UI/UX 개발자로 성장하고자 노력하고 있습니다.
            </p>
          </div>
          <div>
            <span>2.</span>
            <h3>코드로 소통하는 개발자</h3>
            <p>
              코드로써 나의 생각을 표현하는 것을 좋아하고 타 개발자의 코드를 보며 왜 이렇게 짰을까의 대한 고민도
              저에게는 소통으로 다가왔습니다.
              커뮤니케이션이 중요한 업무인 만큼, 코드로써 소통을 진행하기 위해
              퍼블리싱에서 그치지 않고 프론트엔드 일도 담당하며 코드 언어에 대한 공부를 끊임 없이 하고 있습니다.
            </p>
          </div>
          <div>
            <span>3.</span>
            <h3>장점은 극대화하고 단점은 보완할줄 아는 개발자</h3>
            <p>
              매년 새로운 기술들이 쏟아지는 개발 업무를 보며 실무에 적용할지 말지에 대한 문제로 회의에 참가한적이 있습니다.
              그때 브레인스토밍을 통해 장점과 단점을 분석해보았고 각자의 의견을 주고 받으며 소통하여 어떤것이 사용자에게 더 좋은 경험을 제공할 수 있을까
              고민했던 적이 있습니다.
              꼭 브레인스토밍이 아니더라도 강점과 약점을 분석하는데서부터 좋은 개발자가 되기 위한 첫 걸음을 떼었다고 생각합니다.
            </p>
          </div>
        </div>
      </div>
    </section>
  );
};

export default Skill;