import React from "react";

const Skill = () => {
  return (
    <section id="skill">
      <div className="skill__inner">
        <h2 className="skill__title">Challenge <em>나의 도전</em></h2>
        <div className="skill__desc">
          <div>
            <span>1.</span>
            <h3>UI/UX 개발자</h3>
            <p>
              웹 퍼블리셔이자 프론트엔드 개발자로서 HTML, CSS, JavaScript를 활용해 다양한 웹사이트의 레이아웃과 기능을 구현해왔습니다.
              특히 사용자와 상호작용하는 인터랙티브적인 요소(애니메이션, 스크롤 이벤트, 다양한 이펙트, 모달(팝업창), 드롭다운 기능 등)를 구현하며
              사용자 경험을 한층 더 향상시키는 것을 목표로 해왔습니다.
              단순히 사이트 구현에 그치지 않고, 사용자 중심의 최적화된 웹 환경을 만드는 데 집중하며
              UI/UX 개발자로 성장하고자 노력하고 있습니다.
            </p>
          </div>
          <div>
            <span>2.</span>
            <h3>코드로 소통하는 개발자</h3>
            <p>
              코드로써 나의 생각을 표현하는 것을 좋아하고 타 개발자의 코드를 보며 왜 이렇게 짰을까의 대한 고민도
              저에게는 소통으로 다가왔습니다.
              커뮤니케이션이 중요한 업무인 만큼, 코드로써 소통을 진행하기 위해
              퍼블리싱에서 그치지 않고 프론트엔드 일도 담당하며 코드 언어에 대한 공부를 끊임 없이 하고 있습니다.
            </p>
          </div>
          <div>
            <span>3.</span>
            <h3>출발점은 다르지만 도착점은 같은 개발자</h3>
            <p>
              저는 호텔경영이라는 전혀 코딩과 상관없는 과를 졸업하여
              아주 작고 작은 기초밖에 모르는 사람이였습니다.
              뒤늦게 시작하여 모든게 부족하고 느리게 느껴졌지만
              원하는 것을 이루기 위해서는 그만한 노력을 해야했습니다.
              항상 맞춘 시간보다 10~ 20분 일찍 도착하여 부족한 부분을 공부하고,
              쉬는날에도 힘들더라도 한 번 더 보려 하였습니다.
              이 작은 노력이 모이고 모여 조금 느릴지라도 포기하지 않고 나아가고 있습니다.
            </p>
          </div>
        </div>
      </div>
    </section>
  );
};

export default Skill;